---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
MechanicalSystem..::..Remove Method
MechanicalSystem Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Remove(ConnectorSet) | Removes connectors from system. (Inherited from MEPSystem.) |
|  | Remove(ICollection<(Of <<'(ElementId>)>>)) | Remove elements from system. (Inherited from MEPSystem.) |

# See Also

MechanicalSystem Class

MechanicalSystem Members

Autodesk.Revit.DB.Mechanical Namespace